In [2]:
! pip install pandas

Requirement already satisfied: pandas in c:\users\admin\anaconda3\lib\site-packages (1.4.2)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\admin\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\admin\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: numpy>=1.18.5 in c:\users\admin\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: six>=1.5 in c:\users\admin\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [3]:
import pandas as pd

In [4]:
# Check pandas __version__
pd.__version__

'1.4.2'

In [5]:
pd.Series()

C:\Users\admin\AppData\Local\Temp\ipykernel_17960\2031691219.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  pd.Series()

Series([], dtype: float64)

In [6]:
# Create Series pd.Series
# 1, 2, 3, 4, 5

pd.Series([1, 2, 3, 4, 5], ['apurba', 'rohit', 'c', 'd', 'e'])

apurba    1
rohit     2
c         3
d         4
e         5
dtype: int64

In [7]:
# if you define the sequence then it will work accordingly
# other wise it will work with default constraints

pd.Series(index = [1, 2, 3, 4, 5], data = ['a', 'b', 1, 2, 3])

1    a
2    b
3    1
4    2
5    3
dtype: object

In [8]:
pd.Series([6, 7, 8, 9, 10], [1, 2, 3, 4, 5])

1     6
2     7
3     8
4     9
5    10
dtype: int64

In [9]:
# Series through Dictionary values.

run_km = {"day1" : 10.01,
          "day2" : 12.24,
          "day3" : 15.78}

series = pd.Series(run_km)
print(series)

day1    10.01
day2    12.24
day3    15.78
dtype: float64

In [10]:
data = {'a' : 0.,
        'b' : 1.,
        'c' : 2.}

s = pd.Series(data, index = ['b', 'd'])

In [11]:
print(s)

b    1.0
d    NaN
dtype: float64

In [12]:
s1 = pd.Series(data, index = ['x', 'y', 'z'])
s1

x   NaN
y   NaN
z   NaN
dtype: float64

In [13]:
# if you want to copy same element in differnet indexes

s = pd.Series(10, index = [0, 1, 2, 3, 4, 5])
print(s)

0    10
1    10
2    10
3    10
4    10
5    10
dtype: int64

In [14]:
# s = pd.Series([10, 20], index = [0, 1, 2, 3, 4])
# print(s)

# this won't work
# as you are giving two values and 5 indexes

In [15]:
# Repeat the series
## Single value repeat(n)
pd.Series(10).repeat(5)

0    10
0    10
0    10
0    10
0    10
dtype: int64

In [16]:
## multiple value repeat([n, m])
pd.Series([10, 20]).repeat([5, 2])

0    10
0    10
0    10
0    10
0    10
1    20
1    20
dtype: int64

In [17]:
# Some more functions just with tab

In [18]:
s = pd.Series(data = [10, 20, 30, 40, 50], index = [1, 2, 3, 4, 5])
print(s)

1    10
2    20
3    30
4    40
5    50
dtype: int64

In [19]:
# [start:end]

In [20]:
# Access data from Series
# By index
# s[3]

# By first n numbers
# s[-1]

# By Last n numbers
# s[1:-1]

# By Labeled index
# s[4]

# By multiple label index

# s[[3, 4]]

* Some important / most frequently used functions in pandas series.

In [21]:
ser = pd.Series([1, 2, -3, -4, 5])
ser1 = pd.Series(['a', 'b', 'c', 'd', 'e'])

In [22]:
ser

0    1
1    2
2   -3
3   -4
4    5
dtype: int64

In [23]:
# Abs [Absolute (All positive)]
ser.abs()

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [24]:
# Agg (aggregate values) [min...]
ser = pd.Series([1, 2, 3, 4, 5, 20, 100, 200, -1])
ser.agg([min, max, sum])

min     -1
max    200
sum    334
dtype: int64

In [25]:
# append (concatenate 2 series) .append(s)

In [26]:
ser1 = pd.Series([1, 2, 3, 4, 5, 20, 100, 200, -1])
ser2 = pd.Series([10, 20, 30, 40, 50])

In [27]:
ser1

0      1
1      2
2      3
3      4
4      5
5     20
6    100
7    200
8     -1
dtype: int64

In [28]:
ser2

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [29]:
ser3 = ser1.append(ser2)
ser3

C:\Users\admin\AppData\Local\Temp\ipykernel_17960\937921848.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  ser3 = ser1.append(ser2)

0      1
1      2
2      3
3      4
4      5
5     20
6    100
7    200
8     -1
0     10
1     20
2     30
3     40
4     50
dtype: int64

In [30]:
ser3[0]

0     1
0    10
dtype: int64

In [31]:
ser3.reset_index(drop = True)

0       1
1       2
2       3
3       4
4       5
5      20
6     100
7     200
8      -1
9      10
10     20
11     30
12     40
13     50
dtype: int64

<b>Data Frames</b>

* Rows and Columns

In [32]:
import pandas as pd

In [33]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [34]:
# Create Dataframe

myFirstDataSet = {
    'name' : ["tom", "jerry", "spike", "abc", "def", "fgjs", "dsadfa", "asdskjdf"],
    'age' : [10, 12, 14, 15, 16, 15, 50, 80]
}

dataframe = pd.DataFrame(myFirstDataSet)
dataframe
# print(dataframe)

       name  age
0       tom   10
1     jerry   12
2     spike   14
3       abc   15
4       def   16
5      fgjs   15
6    dsadfa   50
7  asdskjdf   80

In [35]:
abc = [['tom', 10], ['jerry', 12], ['spike', 14]]

df = pd.DataFrame(abc,['a', 'b', 'c'], columns = ['Name', "Age"]) 
#, dtype = float
df

    Name  Age
a    tom   10
b  jerry   12
c  spike   14

In [36]:
data = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data)
df

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [37]:
data = [{'a': 5, 'b': 10, 'c': 20},
        {'a': 1, 'b': 2},
        {'a': 1, 'b': 2, 'c': 10, 'd': 70}]

df = pd.DataFrame(data)
df

   a   b     c     d
0  5  10  20.0   NaN
1  1   2   NaN   NaN
2  1   2  10.0  70.0

In [38]:
data = [{'a': 5, 'b': 10, 'c': 20},
        {'a': 1, 'b': 2},
        {'a': 1, 'b': 2, 'c': 10, 'd': 70}]

df = pd.DataFrame(data, index = ['aa', 'bb', 'cc'])
df

    a   b     c     d
aa  5  10  20.0   NaN
bb  1   2   NaN   NaN
cc  1   2  10.0  70.0

### Slicing - loc & iloc

* label & integer / integrr
* list of labels/list of integers
* [A:B] both included/B excluded
* loc[row_label, column_label]/iloc[row_position, column_position]


* iloc - both intgers
* loc - row can be integer/label, column - label

In [39]:
# df.loc[  row condition  ,  column condition]

In [40]:
data = {'one': pd.Series([1, 2, 3, 4]),
        'two': pd.Series([10, 20, 30, 40]),
        'three': pd.Series([100, 200, 300, 400]),
        'four': pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [41]:
df.iloc[1:3, 1:3]

   two  three
1   20    200
2   30    300

In [42]:
df.loc[1:3, 'two': 'four']

   two  three  four
1   20    200  2000
2   30    300  3000
3   40    400  4000

In [43]:
24:24

SyntaxError: illegal target for annotation (1183193390.py, line 1)

### Crash Course

In [53]:
import pandas as pd
import numpy as np

In [54]:
data = np.arange(0, 20).reshape(5, 4)

In [55]:
# Create Dataframe
df = pd.DataFrame(data, 
            index = ["Row1", "Row2", "Row3", "Row4", "Row5"],
            columns = ["Column1", "Column2", "Column3", "Column4"])

In [56]:
# 5 recordes from the top
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [57]:
# 5 recordes from below
df.tail()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [58]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Row1 to Row5
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Column1  5 non-null      int32
 1   Column2  5 non-null      int32
 2   Column3  5 non-null      int32
 3   Column4  5 non-null      int32
dtypes: int32(4)
memory usage: 120.0+ bytes

In [59]:
df.describe()

         Column1    Column2    Column3    Column4
count   5.000000   5.000000   5.000000   5.000000
mean    8.000000   9.000000  10.000000  11.000000
std     6.324555   6.324555   6.324555   6.324555
min     0.000000   1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000   7.000000
50%     8.000000   9.000000  10.000000  11.000000
75%    12.000000  13.000000  14.000000  15.000000
max    16.000000  17.000000  18.000000  19.000000

In [60]:
# Indexing
    # columnname, rowindex[loc], rowindex number and columnindex number[.iloc]

df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [61]:
# Read data from columns only (data slicing according to column indexing)
df[['Column1', 'Column2', 'Column3']]

      Column1  Column2  Column3
Row1        0        1        2
Row2        4        5        6
Row3        8        9       10
Row4       12       13       14
Row5       16       17       18

In [62]:
# for one column
print(df['Column1'])

# type(df['Column1'])
# It's a series as there is only one column involved

Row1     0
Row2     4
Row3     8
Row4    12
Row5    16
Name: Column1, dtype: int32

In [63]:
# for more than one column
print(df[['Column1', 'Column2']])

      Column1  Column2
Row1        0        1
Row2        4        5
Row3        8        9
Row4       12       13
Row5       16       17

In [64]:
# row indexing - loc
df.loc['Row3']

# It's also a series

Column1     8
Column2     9
Column3    10
Column4    11
Name: Row3, dtype: int32

In [65]:
df.loc[['Row2', 'Row4']]

      Column1  Column2  Column3  Column4
Row2        4        5        6        7
Row4       12       13       14       15

In [66]:
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [67]:
# indexing with both row and column numbers - iloc
# df.iloc[row, col]

df.iloc[2:4, 0:2]

      Column1  Column2
Row3        8        9
Row4       12       13

In [68]:
df.iloc[2:, 1:]      #[row, col]

      Column2  Column3  Column4
Row3        9       10       11
Row4       13       14       15
Row5       17       18       19

In [69]:
df.iloc[:, 1:]

      Column2  Column3  Column4
Row1        1        2        3
Row2        5        6        7
Row3        9       10       11
Row4       13       14       15
Row5       17       18       19

In [70]:
## to convert dataframe into arrays
df.iloc[:, 1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [71]:
# basic operations in pandas
# to check if there is any null values in the matrix(dataframe)

df.isnull().sum()

Column1    0
Column2    0
Column3    0
Column4    0
dtype: int64

In [72]:
# Creating a new Dataframe with nan value
df = pd.DataFrame(data = [[1, np.nan, 2], [1, 3, 4]], 
            index = ["Row1", "Row2"],
            columns = ["Column1", "Column2", "Column3"])

print(df)

      Column1  Column2  Column3
Row1        1      NaN        2
Row2        1      3.0        4

In [73]:
df.isnull().sum() # i.e. there is a null value in column 2

Column1    0
Column2    1
Column3    0
dtype: int64

In [74]:
df.isnull().sum() == 0

Column1     True
Column2    False
Column3     True
dtype: bool

In [75]:
df

      Column1  Column2  Column3
Row1        1      NaN        2
Row2        1      3.0        4

In [76]:
# unique enries in any column or row
df['Column3'].value_counts()

2    1
4    1
Name: Column3, dtype: int64

In [77]:
df['Column3'].unique()

array([2, 4], dtype=int64)

In [78]:
df[df['Column2'] > 2]

      Column1  Column2  Column3
Row2        1      3.0        4